IDENTIFICATION DIVISION.
PROGRAM-ID. TEMPLATE-MAIN.
*>
*>  Example Main CobCurses Program
*>  Warren W. Gay
*>
*>  $Id: template_main.cob,v 1.4 2007/10/30 13:05:20 ve3wwg Exp $
*>
*>  THE PURPOSE OF THIS MODULE IS TO INITIALIZE AND OPEN
*>  THE TERMINAL INTERFACE USING COBCURSES. THE OPEN IS
*>  ACCOMPLISHED BY PERFORM NC-OPEN, WHILE NC-CLOSE SHUTS
*>  DOWN THE TERMINAL INTERFACE.
*>
*>  THIS SOURCE MUST BE COMPILED WITH OPEN-COBOL'S -free
*>  OPTION FOR FREE-FORM SOURCE CODE.
*>
DATA DIVISION.
WORKING-STORAGE SECTION.

    COPY COBCURSG.                                      *> DEFINE COBCURSES GLOBALS

PROCEDURE DIVISION.

    PERFORM NC-OPEN.                                    *> OPEN THE TERMINAL INTERFACE
    CALL "TEMPLATE-SCREEN" USING NC-COBCURSES.          *> CALL THE SCREEN COBOL PROGRAM
    PERFORM NC-CLOSE.                                   *> CLOSE THE TERMINAL INTERFACE
    STOP RUN.

COPY COBCURSP.                                          *> THIS PROVIDES OPEN/CLOSE SUPPORT PARAGRAPHS

END PROGRAM TEMPLATE-MAIN.

*> $Source: /cvsroot/cobcurses/cobcurses/src/test/template_main.cob,v $
