        IDENTIFICATION DIVISION.
        PROGRAM-ID. SD002000.
      *>
      *> THIS IS THE MAIN PROGRAM FOR THE SDESIGN COMMAND. THIS IS THE
      *> "SCREEN DESIGNER" PROGRAM, THAT THE USER USES FOR DEFINING
      *> SCREENS, FIELDS, STATES, CHARACTER SETS ETC. FOR THE GENERATION
      *> OF COBOL SCREEN CODE.
      *>
        DATA DIVISION.
        WORKING-STORAGE SECTION.

            COPY COBCURSG.

        PROCEDURE DIVISION.

        MAIN-PROGRAM.
            PERFORM NC-OPEN.
            CALL "SD002010"
              USING
                BY REFERENCE NC-COBCURSES.
            PERFORM NC-CLOSE.
            STOP RUN.

        COPY COBCURSP.

        END PROGRAM SD002000.
