      *>
      *> NCURSES ATTRIBUTE DEFINITIONS :
      *>
        01  NC-ATTRIBUTE-DEFINITIONS.
            10  NC-ATTR-ATTRIBUTES PIC 9(9) COMP-5
                                   VALUE 65535 SYNCHRONIZED.
            10  NC-ATTR-NORMAL     PIC 9(9) COMP-5
                                   VALUE 1 SYNCHRONIZED.
            10  NC-ATTR-STANDOUT   PIC 9(9) COMP-5
                                   VALUE 2 SYNCHRONIZED.
            10  NC-ATTR-UNDERLINE  PIC 9(9) COMP-5
                                   VALUE 4 SYNCHRONIZED.
            10  NC-ATTR-REVERSE    PIC 9(9) COMP-5
                                   VALUE 8 SYNCHRONIZED.
            10  NC-ATTR-BLINK      PIC 9(9) COMP-5
                                   VALUE 16 SYNCHRONIZED.
            10  NC-ATTR-DIM        PIC 9(9) COMP-5
                                   VALUE 32 SYNCHRONIZED.
            10  NC-ATTR-BOLD       PIC 9(9) COMP-5
                                   VALUE 64 SYNCHRONIZED.
      *>
      *> END NCURSES ATTRIBUTE DEFINITONS.
      *>

