      *>
      *> NCURSES COLOUR DEFINITIONS :
      *>
        01  NC-COLOUR-DEFINITIONS.
            10  NC-COLOUR-BLACK    PIC 9(4) COMP-5 VALUE 0
                                            SYNCHRONIZED.
            10  NC-COLOUR-RED      PIC 9(4) COMP-5 VALUE 1
                                            SYNCHRONIZED.
            10  NC-COLOUR-GREEN    PIC 9(4) COMP-5 VALUE 2
                                            SYNCHRONIZED.
            10  NC-COLOUR-YELLOW   PIC 9(4) COMP-5 VALUE 3
                                            SYNCHRONIZED.
            10  NC-COLOUR-BLUE     PIC 9(4) COMP-5 VALUE 4
                                            SYNCHRONIZED.
            10  NC-COLOUR-MAGENTA  PIC 9(4) COMP-5 VALUE 5
                                            SYNCHRONIZED.
            10  NC-COLOUR-CYAN     PIC 9(4) COMP-5 VALUE 6
                                            SYNCHRONIZED.
            10  NC-COLOUR-WHITE    PIC 9(4) COMP-5 VALUE 7
                                            SYNCHRONIZED.
      *>
      *> END NCURSES COLOUR DEFINITONS.
      *>

