      *>
      *> Extra CobCurses Routines :
      *>
        NC-EXTRA-INIT.
            PERFORM NC-SHLIB-EXTRA-INIT.
            EXIT.

        NC-EXTRACT-CSV-FIELD.
            PERFORM NC-SHLIB-EXTRA-INIT.
            CALL "COBCURSES-EXTRACT-CSV-FIELD"
		USING BY REFERENCE COBCURSES-EXTRAS.
            EXIT.

        NC-CLEAR-CSV-HEADINGS.
            PERFORM NC-SHLIB-EXTRA-INIT.
            CALL "COBCURSES-CLEAR-CSV-HEADINGS".
            EXIT.

        NC-LOAD-CSV-HEADINGS.
            PERFORM NC-SHLIB-EXTRA-INIT.
            CALL "COBCURSES-LOAD-CSV-HEADINGS"
		USING BY REFERENCE COBCURSES-EXTRAS.
            EXIT.

        NC-REGISTER-CSV-COLUMN-NO.
            PERFORM NC-SHLIB-EXTRA-INIT.
            CALL "COBCURSES-REGISTER-CSV-COL-NO"
                USING BY REFERENCE COBCURSES-EXTRAS.
            EXIT.

        NC-REGISTER-CSV-COLUMN.
            PERFORM NC-SHLIB-EXTRA-INIT.
            CALL "COBCURSES-REGISTER-CSV-COLUMN"
                USING BY REFERENCE COBCURSES-EXTRAS.
            EXIT.

        NC-REGISTER-CSV-COLUMN-HEADING.
            PERFORM NC-SHLIB-EXTRA-INIT.
            CALL "COBCURSES-REGISTER-CSV-COL-HDG"
                USING BY REFERENCE COBCURSES-EXTRAS.
            EXIT.

        NC-EXTRACT-CSV-RECORD.
            PERFORM NC-SHLIB-EXTRA-INIT.
            CALL "COBCURSES-EXTRACT-CSV-RECORD"
		USING BY REFERENCE COBCURSES-EXTRAS.
            EXIT.

        NC-COUNT-CSV-COLUMNS.
            PERFORM NC-SHLIB-EXTRA-INIT.
            CALL "COBCURSES-COUNT-CSV-COLUMNS"
		USING BY REFERENCE COBCURSES-EXTRAS.
            EXIT.

        NC-EMIT-CSV-HEADINGS.
            PERFORM NC-SHLIB-EXTRA-INIT.
            CALL "COBCURSES-EMIT-CSV-HEADINGS"
		USING BY REFERENCE COBCURSES-EXTRAS.
            EXIT.

        NC-EMIT-CSV-RECORD.
            PERFORM NC-SHLIB-EXTRA-INIT.
            CALL "COBCURSES-EMIT-CSV-RECORD"
		USING BY REFERENCE COBCURSES-EXTRAS.
            EXIT.

      *>
      *> DO NOT CALL THIS PARAGRAPH. IT IS INTERNAL
      *> AND MEANT TO BE TRANSPARENT TO YOUR APPLICATION.
      *>
        NC-SHLIB-EXTRA-INIT.
	    IF NC-SHLIB-EXTRA-NI THEN
                PERFORM NC-INTERNAL-EXTRA-INIT
            END-IF.
            EXIT.

        NC-INTERNAL-EXTRA-INIT.
            CALL "libcobcursex".
            MOVE 'Y' TO NC-SHLIB-EXTRA-FLAG.
            EXIT.
