      *>
      *>    MENU [ITEM] DETAIL RECORDS
      *>
            10  ITM-KEY.
                15  ITM-MENU-NAME               PIC X(16).
		15  ITM-NUMBER			PIC 9999.
            10  ITM-DATA.
                15  ITM-ITEM-NAME               PIC X(32).
                15  ITM-TEXT                    PIC X(64).
                15  ITM-SELECTABLE              PIC X.
                15  FILLER                      PIC X(31).
