      *>
      *>    MENU HEADER RECORD
      *>
            10  MNU-KEY.
                15  MNU-MENU-NAME               PIC X(16).
            10  MNU-DATA.
                15  MNU-MENU-TYPE               PIC 99.
                15  MNU-TITLE                   PIC X(64).
                15  MNU-TOP-LEFT-LINE-NO        PIC 999.
                15  MNU-TOP-LEFT-COLUMN-NO      PIC 999.
                15  MNU-OPT-ONEVALUE            PIC X.
                15  MNU-OPT-ROWMAJOR            PIC X.
                15  MNU-OPT-IGNORECASE          PIC X.
                15  MNU-OPT-SHOWDESC            PIC X.
                15  MNU-OPT-NONCYCLIC           PIC X.
                15  MNU-OPT-SHOWMATCH           PIC X.
                15  MNU-OPT-ROWS                PIC 99.
                15  MNU-OPT-COLS                PIC 99.
                15  MNU-MODULE-NAME             PIC X(16).
                15  MNU-ITEM-LIMIT              PIC 9999.

