            10  SCR-FDEF-KEY.
                20  SCR-FDEF-SCREEN-NAME        PIC X(16).
                20  SCR-FDEF-NO                 PIC 999.
            10  SCR-FDEF-COBOL-NAME             PIC X(32).
            10  SCR-FDEF-DESCRIPTION            PIC X(40).
            10  SCR-FDEF-LINE                   PIC 999.
            10  SCR-FDEF-COLUMN                 PIC 999.
            10  SCR-FDEF-BUFFER-LENGTH          PIC 9999.
            10  SCR-FDEF-WINDOW-LENGTH          PIC 9999.
            10  SCR-FDEF-CLEAR                  PIC X.
            10  SCR-FDEF-UPPERCASE              PIC X.
            10  SCR-FDEF-PASSWORD               PIC X.
            10  SCR-FDEF-NOT-BLANK              PIC X.
            10  SCR-FDEF-YN                     PIC X.
            10  SCR-FDEF-RES-CHARSET            PIC X(8).
            10  SCR-FDEF-SIGNED                 PIC X.
            10  SCR-FDEF-DIGITS                 PIC 999.
            10  SCR-FDEF-DECIMALS               PIC 999.
            10  SCR-FDEF-VERIFY                 PIC X.
            10  SCR-FDEF-VISIBLE                PIC X.
            10  SCR-FDEF-IGNORE-CHANGES         PIC X.
            10  SCR-FDEF-INPUT-SEQ              PIC X.
            10  SCR-FDEF-ACTION                 PIC X.
            10  SCR-FDEF-HELP                   PIC X(80).
            10  SCR-FDEF-READ-ONLY              PIC X.
            10  SCR-FDEF-COMP-TYPE              PIC 99.
            10  SCR-FDEF-MENU-REF               PIC X(16).
            10  SCR-FDEF-ACTION-EDIT            PIC X.
            10  FILLER                          PIC X(13).

