            10  SCR-FST-KEY.
                20  SCR-FST-SCREEN-NAME         PIC X(16).
                20  SCR-FST-STATE-NO            PIC 999.
            10  SCR-FST-FIELD-NO                PIC 999.
            10  SCR-FST-BACK-TO                 PIC 999.
            10  SCR-FST-FORWARD-TO              PIC 999.
            10  SCR-FST-ESCAPE-TO               PIC 999.
            10  SCR-FST-SLASH-TO                PIC 999.
            10  SCR-FST-GROUP-HEADER            PIC X.
            10  SCR-FST-STATE-COBOL-NAME        PIC X(24).
