            10  SCRBG-KEY.
                20  SCRBG-NAME                  PIC X(16).
                20  SCRBG-SEGMENT-NO            PIC 999.
            10  SCRBG-LINE                      PIC 999.
            10  SCRBG-COLUMN                    PIC 999.
            10  SCRBG-LENGTH                    PIC 99.
            10  SCRBG-SEGMENT                   PIC X(32).
            10  SCRBG-ATTRIBUTE                 PIC 9(9) COMP
		SYNCHRONIZED.
            10  SCRBG-COLOUR-PAIR               PIC 9999.
            10  SCRBG-FILLER                    PIC X(16).
