      *>    $Id: SCREEN-CS.cbl,v 1.2 2007/10/24 03:37:40 ve3wwg Exp $
            10  CHARSET-NAME                PIC X(8).
            10  CHARSET-DATA                PIC X(80).
