      *>
      *>     RECORD LAYOUT FOR SCREENS.X :
      *>
            10  SCN-NAME                        PIC X(16).
            10  SCN-DESCRIPTION                 PIC X(50).
            10  SCN-AUTHOR                      PIC X(32).
            10  SCN-NOTES                       PIC X(50).
            10  SCN-TITLE                       PIC X(50).
            10  SCN-SHOW-DATE                   PIC X.
            10  SCN-SHOW-TIME                   PIC X.
            10  SCN-ACTION-REQUIRED             PIC X.
            10  SCN-COLUMNS-MIN                 PIC 999.
            10  SCN-LINES-MIN                   PIC 999.
            10  SCN-PAIRS                       PIC 999.
            10  SCN-WS-SECTION                  PIC X(16).
            10  SCN-LINKAGE-SECTION             PIC X(16).
            10  SCN-PROCEDURE-DIVISION          PIC X(16).
            10  SCN-STRIP-CHARACTER             PIC X.
            10  FILLER                          PIC X(32).
      *>
