      *> $Id: TEMPDATA.cbl,v 1.3 2007/10/24 03:37:40 ve3wwg Exp $
            10  DTA-KEY                     PIC X(8).
            10  DTA-DATA                    PIC X(32).
            10  DTA-DESC                    PIC X(40).
            10  DTA-COMP-2                  PIC X(12).
